'''
########################################################################################
Сайт библиотеки:
    --> https://pypi.org/
    --> https://gbcdn.mrgcdn.ru/uploads/asset/3836210/attachment/eb3c9895bd52250d298d5ba88ba45a99.pdf


Добавление пакета в проект:
    --> python3 -m venv .folder //folder - название папки, куда идут пакеты
    --> открыть новый терминал (должно быть (.folder) )
    --> команда установки пакета (на сайте)
    --> импорт библиотеки

    Прогресс бар библиотека:
        --> https://pypi.org/project/progress/

    Эмоджи библиотека:
        --> https://pypi.org/project/emoji/


########################################################################################
Бот телеграмм:
    --> https://telegram.org/
    --> https://core.telegram.org/bots
    --> https://python-telegram-bot.org/ (библиотека)
    --> Токен:
        --> https://t.me/botfather --> команда /newbot --> имя бота --> user_name_bot (bot обязательно)

    --> Запуск бота -- python main.py

########################################################################################
Выгрузка библиотек PyCharm:
    --> VirtualVens
'''
